require "os"

tap "1password/tap"

puts "🚀 Installing packages.."

tap "FelixKratz/formulae"

brew "bat"
brew "beads"
brew "borders"
brew "eza"
brew "fabric-ai"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "lazydocker"
brew "jq"
brew "mise"
brew "neovim"
brew "ripgrep"
brew "starship"
brew "tealdeer"
brew "tmuxinator"
brew "zellij"
brew "zoxide"

if OS.mac?
  cask "nikitabobko/tap/aerospace"

  cask "1password-cli"
  cask "anki"
  cask "claude-code"
  cask "discord"
  cask "flameshot"
  cask "font-caskaydia-mono-nerd-font"
  cask "font-fira-code-nerd-font"
  cask "font-hack-nerd-font"
  cask "font-meslo-lg-nerd-font"
  cask "font-symbols-only-nerd-font"
  cask "google-chrome"
  cask "kitty"
  cask "raycast"
  cask "slack"
  cask "trex"
  cask "visual-studio-code"
  cask "vivaldi"
  cask "voicenotes"
  cask "zoom"
end
